app/views/my_group/index.html.erb

<% @mygroup.each do |mygrp| %>
		<h3><li><%= link_to mygrp.groupname, my_group_path(mygrp), :method => :get %></li></h3>
---
SELECT  "my_groups".* FROM "my_groups" WHERE "my_groups"."groupname" = $1 LIMIT 1  [["groupname", "someG"]]