app/views/my_group/show.html.erb

 <% @projects.each do |proj| %>
 	<% if proj.group_name == @group.groupname %>
---
SELECT  "my_groups".* FROM "my_groups" WHERE "my_groups"."group" = $1 LIMIT 1  [["group", "1"]]