app/controllers/add_project_controller.rb

 def index
  @add_proj = AddProject.all
---
SELECT "add_projects".* FROM "add_projects"

 def explore
   @add_proj = AddProject.all
---
SELECT "add_projects".* FROM "add_projects"

 def edit
 #confirm "Are you sure?"
  @add_project = AddProject.find(params[:id])
---
SELECT  "add_projects".* FROM "add_projects" WHERE "add_projects"."id" = ? LIMIT 1  [["id", 1]]

 def show
  @add_proj = AddProject.find(params[:id])
---
SELECT  "add_projects".* FROM "add_projects" WHERE "add_projects"."id" = ? LIMIT 1  [["id", 7]]

 def create
  @add_project = AddProject.new(add_project_param)
	admin_1 = working_user
	@add_project[:admin] = admin_1[:username]
	if @add_project.save
---
INSERT INTO "add_projects" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "abdc"], ["created_at", "2016-03-04 18:04:21.442227"], ["updated_at", "2016-03-04 18:04:21.442227"]]

 def update
  @add_project = AddProject.find(params[:id])

  if @add_project.update(add_project_param)
---
SELECT  "add_projects".* FROM "add_projects" WHERE "add_projects"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "add_projects" SET "title" = ?, "group" = ?, "group_name" = ?, "link" = ?, "info" = ?, "deadline" = ?, "updated_at" = ? WHERE "add_projects"."id" = ?  [["title", "hello world"], ["group", "f"], ["group_name", ""], ["link", ""], ["info", "abcd"], ["deadline", "2016-03-07"], ["updated_at", "2016-03-07 07:52:38.089322"], ["id", 1]]

 def destroy
  @add_project = AddProject.find(params[:id])
  @add_project.destroy
---
SELECT  "add_projects".* FROM "add_projects" WHERE "add_projects"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "add_projects" WHERE "add_projects"."id" = ?  [["id", 1]]