app/controllers/home_controller.rb

INSERT INTO "user_details" ("email", "password_digest", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5)  [["email", "abc@cde.com"], ["password_digest", "password"], ["username", "afdsfas"], ["created_at", "2016-04-30 18:07:19.985692"], ["updated_at", "2016-04-30 18:07:19.985692"]]
---
def create
    @user = UserDetail.new(user_param)
    if @user.save