app/controllers/members_controller.rb

def create
	group_searched = params[:groupname]
	@found = MyGroup.find_by(group: group_searched[:groupname])
	if @found != nil
		@group = Group.new(group_param)
		admin_1 = working_user
		@group[:user_name] = admin_1[:username]
		@group[:verified_by_user]=false
		if @group.save
---
SELECT  "my_groups".* FROM "my_groups" WHERE "my_groups"."groupname" = $1 LIMIT 1  [["groupname", "some group 2"]]
INSERT INTO "groups" ("group", "user_name", "verified_by_user", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["group", "Some Group"], ["user_name", "test3"], ["verified_by_user", "f"], ["created_at", "2017-04-27 20:01:27.770731"], ["updated_at", "2017-04-27 20:01:27.770731"]]

def edit
 @group = Group.find(params[:id])
---
SELECT  "my_groups".* FROM "my_groups" WHERE "my_groups"."id" = $1 LIMIT 1  [["id", nil]]

def show
	@isAdmin = false
	group = MyGroup.find(params[:id])
	if working_user[:username] == group[:admin]
		@isAdmin = true
	end
	@waiting = Group.where(:groupname => group[:groupname])
---
SELECT  "my_groups".* FROM "my_groups" WHERE "my_groups"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "groups".* FROM "groups" WHERE "groups"."groupname" = $1  [["groupname", "aGroup"]]

def update
  @group = Group.find(params[:id])
  @group.verified_by_user = true
	#ap @group
  if @group.update(group_param)
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "groups" SET "verified_by_user" = $1, "updated_at" = $2 WHERE "groups"."id" = $3  [["verified_by_user", "t"], ["updated_at", "2016-05-01 12:50:21.639739"], ["id", 5]]

def destroy
  @add_project = Group.find(params[:id])
  @add_project.destroy
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 AND "groups"."id" = $2  [["id", 1], ["id", 1]]
DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 2]]