app/controllers/my_group_controller.rb

def index
	@the_user = working_user[:username]
	@group = Group.where(user_name: @the_user).where(verified_by_user: true)
	@mygroup = MyGroup.where(admin: @the_user)
---
SELECT "groups".* FROM "groups" WHERE "groups"."user_name" = $1 AND "groups"."verified_by_user" = $2  [["user_name", "user1"], ["verified_by_user", "t"]]
SELECT "my_groups".* FROM "my_groups" WHERE "my_groups"."admin" = $1  [["admin", "prince"]]

def show
	@projects = AddProject.all
	@group = MyGroup.find_by(id: params[:id])
---
SELECT "add_projects".* FROM "add_projects"
SELECT  "my_groups".* FROM "my_groups" WHERE "my_groups"."id" = $1 LIMIT 1  [["id", 1]]

def create
	@group = MyGroup.new(my_group_param)
	admin_1 = working_user
	@group[:admin] = admin_1[:username]
	if @group.save
---
INSERT INTO "my_groups" ("groupname", "admin", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["groupname", "someGroup"], ["admin", "user1"], ["created_at", "2016-05-02 13:09:31.958004"], ["updated_at", "2016-05-02 13:09:31.958004"]]

def destroy
  group_in_action = MyGroup.find_by(id: params[:id])
  @groups = AddProject.where(group_name: group_in_action[:groupname])
	@groups.each do |the_group|
  		the_group.destroy
  	end
  @groups = Group.where(groupname: group_in_action[:groupname])
	@groups.each do |the_group|
  		the_group.destroy
  end
  @groups = MyGroup.find_by(groupname: group_in_action[:groupname])
  		@groups.destroy
---
SELECT  "my_groups".* FROM "my_groups" WHERE "my_groups"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "add_projects".* FROM "add_projects" WHERE "add_projects"."group_name" = $1 LIMIT 1  [["group_name", "some"]]
SELECT  "add_projects".* FROM "add_projects" WHERE "add_projects"."group" IS NULL LIMIT 1
DELETE FROM "my_groups" WHERE "my_groups"."id" = $1  [["id", 1]]
SELECT  "my_groups".* FROM "my_groups" WHERE "my_groups"."groupname" = $1 LIMIT 1  [["groupname", "aGroup"]]
SELECT  "my_groups".* FROM "my_groups" WHERE "my_groups"."group" = $1 LIMIT 1  [["group", "some"]]
DELETE FROM "add_projects" WHERE "add_projects"."id" = $1  [["id", 49]]