app/controllers/sign_in_controller.rb

  def create
	current_user= UserDetail.find_by(username: params[:sign_in_user][:username])
---
SELECT  "user_details".* FROM "user_details" WHERE "user_details"."username" = $1 LIMIT 1  [["username", "afdsfas"]]

def update
  ap params
  @user = UserDetail.find_by(username: working_user[:username])
	#ap @group
  	if @user.update(user_param)
---
SELECT  "user_details".* FROM "user_details" WHERE "user_details"."username" = $1 LIMIT 1  [["username", "user1"]]
UPDATE "user_details" SET "password_digest" = $1, "updated_at" = $2 WHERE "user_details"."username" = $3  [["password_digest", "$2a$10$zcqAXPGkr1hkR7EwmxdRRe7M.lQa/vkLtaPm0.McrRIAfpc/iHo0S"], ["updated_at", "2016-05-10 14:58:54.858736"], ["username", "user1"]]